# ================= საშინაო დავალება 5 ===================

# 1. დაწერეთ პითონის პროგრამა, რომელიც დასაწყისში შექმნის ცარიელ სიას ([]), თუ მომხარებელი შეიყვანს სიმბოლო 'a'-ს,
# ნიშნავს რომ უნდა დაამატოთ სიაში რიცხვი; თუ აკრიფა 'r', სიიდან უნა წაიშალოს რიცხვი; 'e'-ს შეტანისას პროგრამამ უნდა
# დაასრულოს მუშაობა. მიღებული შედეგი დაბეჭდეთ კონსოლში.

# a – append

# r – remove

# e – exit

# გამოიყენეთ მხოლოდ ეს ბრძანებები და მოახდინეთ სიაზე ზემოქმედება.

lst = []
continue_game = True

while continue_game:
    st = input("Enter 'a', 'r' or 'e': ")

    if st == 'a':
        lst.append(100)
    if st == 'r':
        lst.remove(100)
    if st == 'e':
        continue_game = False

print(lst)


# 2. დაწერეთ პითონის პროგრამა, რომელიც შექმნის სიას my_list_1 = [43, '22', 12, 66, 210, ["hi"]], და შეასრულებს შემდეგ
# ნაბიჯებს:

# a. დაბეჭდავს 210-ის ინდექსს;

# b. დაამატებს ბოლო ელემენტში ტექსტს "hello";

# c. წაშლის მეორე ინდექსზე მდგომ ელემენტს და დაბეჭდავს სიას;

# d. შექმენით ახალი სია my_llist_2, რომელსაც ექნება my_llist_1-ის მნიშვნელობა, გაასუფთავეთ my_llist_2-ის მნიშნველობა და
# დაბეჭდეთ ორივე სია.

# მინიშნება: სიის გასუფთავება – arr.clear()

my_list_1 = [43, '22', 12, 66, 210, ["hi"]]

# a.
print(my_list_1.index(210))

# b.
my_list_1[-1].append("hello")

# c.
my_list_1.remove('22')
print(f'{my_list_1} \n')

# d.
my_list_2 = my_list_1.copy()
my_list_2.clear()
print(my_list_1)
print(my_list_2)


# 3. დაწერეთ პითნის პროგრამა, რომელიც მიიღებს ტელეფონის ნომერს და regex-ით შეამოწმებს შეყვანილი ნომერი იცავს თუ არა
# "(123) 456-789" ფორმატს, თუ იცავს დააბრუნეთ შეყნვაილი ტელეფონის ნომერი, წინააღმდეგ შემთხვევაში გამოიტანეთ
# "Invalid format" ტექსტი.

# მინიშნება: სრული დამთხვევისთვის გამოიყენეთ .fullmatch() მეთოდი re მოდულიდან.

import re

tel_num = input("Enter a tel number: ")

if re.fullmatch('\(\d{3}\) \d{3}-\d{3}', tel_num):
    print(tel_num)
else:
    print("Invalid format")


